[{"id_area":1,"nombre":"Área de Ciencias Básicas","descripcion":"El propósito principal de esta área es proveer al estudiante de los conocimientos (teóricoprácticos), habilidades y actitudes, propios de la disciplina. Acercándolo a su objeto de estudio para el desarrollo pleno de sus potencialidades humanas. Está conformada por 13 asignaturas, correspondientes a 65 créditos equivalentes a 1040 horas."},{"id_area":2,"nombre":"Área de Modelado de Sistemas","descripcion":"El propósito de esta área es proporcionar al estudiante las técnicas y herramientas del paradigma orientado a objetos. Además, las bases para implementar sistemas orientados a la Web y a escritorio. "},{"id_area":3,"nombre":"Área de Tecnologías de la Información","descripcion":"El propósito de esta área es suministrar al estudiante con los conocimientos, habilidades y actitudes de las tecnologías de la información, para aplicarlos en el desarrollo tecnológico. "},{"id_area":4,"nombre":"Área de Formación General Universitaria","descripcion":"El objetivo de esta área es proveer al estudiante con las técnicas y herramientas necesarias para fortalecer el desarrollo integral y profesional del estudiante. "},{"id_area":5,"nombre":"Área de Tronco Común Evolutivo DESIT","descripcion":"En esta área se ubican las asignaturas: Herramientas de Aprendizaje Autónomo y Redacción, ambas en el nivel básico. Las cuales, están dirigidas a la preparación básica del estudiante y son de formación general para asegurar el dominio adecuado del instrumento científico, del análisis en general y de los fundamentos de las metodologías de las ciencias y la investigación en particular, situación que les permitirá desarrollar la capacidad de abordar los problemas científicos y tecnológicos, además de favorecer la comunicación multidisciplinaria."},{"id_area":6,"nombre":"Área de Integración Disciplinaria","descripcion":"Esta área permite consolidar la formación académica del estudiante, afianzando sus destrezas y habilidades, aptitudes críticas, reflexivas y constructivas; logrando una gradual adaptación a su actividad como profesional, generando conciencia, sentido de responsabilidad y vivencia profesional, cooperación organizacional y compromiso social, como complemento al proceso de enseñanza aprendizaje universitario "},{"id_area":7,"nombre":"Área de Optativas","descripcion":"El objetivo de esta área es profundizar en el aprendizaje del estudiante. Por tanto, se ofrecen cinco especialidades mencionadas anteriormente. El área se integra por las asignaturas optativas disciplinarias, las optativas DESIT y las optativas complementarias. Para obtener el número mínimo de horas y créditos establecidos en el plan, el estudiante deberá cursar 5 optativas disciplinarias y 3 asignaturas optativas DESIT. Lo que corresponde a un mínimo de 34 a un máximo de 40 créditos, equivalentes a un mínimo de 544 a un máximo 640 horas."}]